# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'AdoptOpenJDK/openjdk'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure

# Development
brew 'node'
brew 'yarn'
brew 'watchman'
brew 'cocoapods'
brew 'gradle'

# Apps
cask 'firefox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'insomnia'
cask 'skype'
cask 'slack'
cask 'sublime-text'
cask 'transmit'
cask 'vlc'
cask 'visual-studio-code'
cask 'tower'
cask '1password'
cask 'airfoil'
cask 'android-studio'
cask 'android-platform-tools'
cask 'dropbox'
cask 'flux'
cask 'sketch'
cask 'spotify'
cask 'whatsapp'
cask 'figma'
cask 'adoptopenjdk/openjdk/adoptopenjdk8'
cask 'flipper'
cask 'rectangle'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-inter'
cask 'font-montserrat'
cask 'font-open-sans'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'The Unarchiver', id: 425424353
mas 'Microsoft To Do', id: 1274495053
mas 'Color Picker', id: 641027709
mas 'Pocket', id: 568494494
mas 'Sequel Ace', id: 1518036000
